package th.ac.su.babykick;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.widget.TextView;

public class Advice_Activity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_advice_);


        TextView mTitleWindow = findViewById(R.id.titleWindow_advice);
        TextView mMessageWindow = findViewById(R.id.messageWindow_advice);

        mTitleWindow.setText(" แบบบันทึกการนับลูกดิ้น ");

        StringBuilder stringBuilder = new StringBuilder();

        String someMessage = "  ในระยะแรก ของการตั้งครรภ์ทารกจะมีการดิ้น ในรูปแบบที่ต่างกัน โดยทารกจะดิ้นดีมาก แต่เป็นการดิ้นที่ระบบประสาท จะมีการประสานกันน้อยมาก\n" +
                "\n" +
                "   ในระยะหลัง ของการตั้งครรภ์ การดิ้นของทารก จะมีการประสานกันมากขึ้น\n" +
                " \n" +
                "\n" +
                "ทารกในครรภ์จะมีช่วงหลับและตื่นไม่ตรงกันกับมารดา ช่วงระยะเวลานอนหลับของทารกต่อรอบนาน 20 นาที ถึง 2 ชั่วโมง นอกจากนี้แล้วทารกในครรภ์ยังมีการดิ้นในแต่ละช่วงเวลาของวันไม่เท่ากัน โดยพบว่าทารกจะดิ้นมากระหว่างเวลา 21.00 - 01.00 น. และจะดิ้นมากเมื่อมารดารับประทานอาหารเสร็จใหม่ๆ\n" +
                "\n" +
                "องค์ประกอบที่มีผลต่อการดิ้นของทารกในครรภ์   ได้แก่\n" +
                "\n" +
                "   • ระดับกลูโคสในเลือดมารดา\n" +
                "   • มื้ออาหารที่มารดาได้รับ\n" +
                "   • เสียงภายนอกที่มากระตุ้น\n" +
                "   • อาชีพของมารดา\n" +
                "   • ความสนใจของมารดาต่อการดิ้นของทารก\n" +
                " \n" +
                "\n" +
                "ความสำคัญของการนับทารกดิ้นในครรภ์\n" +
                "   การที่ทารกดิ้นน้อยลง มักเกิดร่วมกับภาวะขาดออกซิเจนจนเรื้อรัง และอยู่ในภาวะอันตราย ทารกดิ้นน้อยลงหรือหยุดดิ้นจะพบเป็นเวลาประมาณ 12 - 48 ชั่วโมง ก่อนที่จะเสียชีวิต ดังนั้นการนับทารกดิ้นจะช่วยในการตรวจ\n" +
                "ค้นคว้า หรือแก้ไขภาวะที่อาจทำให้ทารกเสียชีวิต การที่คุณแม่รู้สึกว่าทารกในครรภ์ดิ้นน้อยลงนับเป็นสัญญาณอันตราย ต้องรีบมาพบแพทย์เพื่อตรวจวินิจฉัยต่อไปว่าทารกในครรภ์มีสุขภาพที่ไม่ดีจริงหรือไม่\n" +
                "\n" +
                " \n" +
                "\n" +
                "ควรเริ่มนับทารกดิ้นในครรภ์เมื่อไหร่?\n" +
                "   คุณแม่ควรนับการดิ้นของทารกในครรภ์ เมื่อตั้งครรภ์ประมาณ 28 สัปดาห์ขึ้นไป ทั้งนี้ขึ้นกับภาวะแทรกซ้อนที่อาจพบระหว่างตั้งครรภ์\n" +
                "\n" +
                " \n" +
                "\n" +
                "วิธีการนับการดิ้นของทารกในครรภ์\n" +
                "เริ่มนับทารกดิ้นในครรภ์ตั้งแต่ 09.00 น. โดยนับครบ 10 ครั้ง ใช้เวลาในการนับประมาณ 10-12 ชั่วโมง ถ้านับได้ 10 ครั้งขึ้นไปถือว่าทารกปกติ คุณแม่ควรนับและบันทึกการดิ้นของทารกแต่ละครั้งลงตาราง การนับการดิ้นของทารกแต่ละครั้งให้บันทึกไว้จนครบ 10 ครั้ง ถ้าครบ 12 ชั่วโมง แล้วทารกดิ้นไม่ถึง 10 ครั้ง ให้รีบมาพบแพทย์ทันที\n" +
                "\n" +
                " \n" +
                "\n" +
                "ข้อแนะนำในการนับและบันทึกการดิ้นของทารก\n" +
                "   • ลักษณะการดิ้นของทารก คือ เตะ ยืดตัว บิดตัว\n" +
                "   • ท่าที่ดีที่สุดในการรับรู้ถึงการดิ้นของทารก คือ ท่านอนตะแคงซ้าย\n" +
                "   • ขณะบันทึกคุณแม่ควรอยู่ในที่เงียบ เพราะจะทำให้มีสมาธิในการรับรู้ถึงการดิ้นของทารกได้ดี\n" +
                "   • ต้องบันทึกการดิ้นของทารกทุกวัน\n" +
                "   • โปรดนำแบบบันทึกการดิ้นของทารกมาให้แพทย์หรือพยาบาลดูทุกครั้งที่มาฝากครรภ์\n" +
                " \n" +
                "\n" +
                "วิธีนับลูกดิ้น\n" +
                "   • ครั้งแรก ตอนเช้าในขณะที่คุณแม่ยังไม่มีงานอะไรมากนัก\n" +
                "   • ครั้งที่สอง ตอนเย็นหรือตอนค่ำๆ ขณะที่ลูกน้อยเคลื่อนไหวแรง เริ่มจับเวลาแล้วนับดูว่า ลูกน้อยดิ้นครบ 10 ครั้ง ในเวลาเท่าใดแล้วจดเวลาเอาไว้ (จำนวนครั้งของการดิ้นจะนับรวม ทั้งการเตะ, การเอาศอกมากระทุ้ง, การบิดตัวของลูกน้อย) \n" +
                " \n" +
                "       - บางรายลูกจะดิ้นครบ 10 ครั้ง ภายในเวลาไม่ถึง 10 นาที ก็ไม่ต้องกังวลว่าผิดปกติ อาจจะเป็นวันที่ลูกดิ้นมาก ถ้าลูกดิ้นไม่ถึง 10 ครั้งใน 1 ชั่วโมง ให้คุณแม่ดื่มนม หรือทานอาหารว่าง แล้วนอนพักเริ่มนับการดิ้นของลูกน้อยใหม่ ถ้าใน 1 ชั่วโมง ลูกยังดิ้นไม่ครบ 10 ครั้งให้นับต่อไปและจดไว้ว่าดิ้นครบ 10 ครั้งในเวลากี่ชั่วโมง\n" +
                "       - ถ้าหากครบ 12 ชั่วโมง แล้วลูกยังดิ้นไม่ครบ 10 ครั้ง ให้คุณแม่รีบไปพบแพทย์ แพทย์อาจจะใช้เครื่องฟังเสียง ฟังเสียงหัวใจหรือตรวจอัลตราซาวนด์ หรือใช้เครื่องตรวจสภาพของลูกน้อยในครรภ์ เพื่อดูว่าผิดปกติหรือไม่ต่อไป";


        stringBuilder.append(someMessage);

        mMessageWindow.setText(stringBuilder.toString());
    }
}